package BattleShip;

public class Game {
	private static Player players[] = new Player[2];
	private static Board gameBoard;
	
	public String generateBoards() {
		String board = "";
		/*info.addField("Your Board", "0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟"
		+ "\n1️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n2️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n3️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n4️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n5️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n6️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n7️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n8️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n9️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n🔟🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦", false);

info.addField("Enemy Board", "0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟"
		+ "\n1️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n2️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n3️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n4️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n5️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n6️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n7️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n8️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n9️⃣🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦"
		+ "\n🔟🟦🟦🟦🟦🟦🟦🟦🟦🟦🟦", false);
*/
		return board;
	}
}
